[
  {
    "id": "anime-hub",
    "title": "Anime Hub",
    "description": "A developing project that integrates anime and manga content into a single page for otaku fans.",
    "content": "Anime Hub is an exciting project currently in development, designed for anime and manga enthusiasts. The project aims to bring together a wide array of content related to anime and manga into a single, cohesive page. With a focus on providing a comprehensive experience for otaku fans, Anime Hub will feature information on anime series, manga titles, news, and more. As it’s still in the design phase, the details are evolving, promising a dynamic and engaging platform for anime lovers.",
    "image": "/anime-hub/anime_hub.png",
    "demo": "",
    "sourceCode": "",
    "images": {
      "image1": ""
    },
    "stack": "NextJS, Tailwind CSS, MongoDB, Node.JS, Express.JS, Mongoose"
  },
  {
    "id": "tech-challenge",
    "title": "Tech Challenge",
    "description": "A technical interview project showcasing skills in web development and problem-solving for the Full Stack Developer role at Lazarillo.",
    "content": "The Tech Challenge is a notable project completed as part of the technical interview process for the Full Stack Developer position at Lazarillo (mapvx). This project highlights my technical and development abilities, showcasing my capacity to address and solve complex technical problems. It serves as a testament to my skills and experience in web and software development, reflecting my competence and problem-solving approach.",
    "image": "/tech-challenge/tech_challenge.png",
    "demo": "https://tech-challenge.devnacho.me/",
    "sourceCode": "https://github.com/IgnacioBarraza/Desafio_Tecnico_Lazarillo",
    "images": {
      "image1": "/tech-challenge/tech-challenge-1.png",
      "image2": "/tech-challenge/tech-challenge-2.png",
      "image3": "/tech-challenge/tech-challenge-3.png"
    },
    "stack": "Angular, Bootstrap, Firebase, Node.JS, TypeScript"
  },
  {
    "id": "black-shark-web",
    "title": "Black Shark Web",
    "description": "An ecommerce site for a graphic designer offering photography and graphic design services, featuring an online portfolio and service booking.",
    "content": "Black Shark Web is an ecommerce website created for a graphic designer specializing in photography and graphic design services. This platform allows clients to browse and book various creative services offered by the designer. Designed to be a one-stop solution for the designer’s business, Black Shark Web not only facilitates service bookings but also features an online portfolio showcasing their work. This project is tailored to enhance the designer's online presence and streamline client interactions.",
    "image": "/bsw/proyecto_bsw.png",
    "demo": "https://blacksharkstudiosweb.web.app/",
    "sourceCode": "https://github.com/IgnacioBarraza/BlackSharkWeb",
    "images": {
      "image1": "/bsw/proyecto_bsw-1.png",
      "image2": "/bsw/proyecto_bsw-2.png",
      "image3": "/bsw/proyecto_bsw-3.png",
      "image4": "/bsw/proyecto_bsw-4.png",
      "image5": "/bsw/proyecto_bsw-5.png"
    },
    "stack": "Vite, Tailwind CSS, MySQL, Node.JS, Express.JS, React"
  }
]
